A large view has view detail level set to medium or coarse. Generation of extraneous details harms performance.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ViewDetailLevelIsHighInLargeView { get; }
  Visual Basic
Public Shared ReadOnly Property ViewDetailLevelIsHighInLargeView As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ViewDetailLevelIsHighInLargeView {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures PerformanceFailures Class
  Autodesk.Revit.DB Namespace